Tekla.Structures.CatalogInternal.ConflictHandler
The ConflictHandler class is a class from which the import of catalog items can be started
and finished after conflicts are handled.

Tekla.Structures.CatalogInternal.ConflictHandler.Conflicts
The name of the user property.

Tekla.Structures.CatalogInternal.ConflictHandler.#ctor
Creates a new catalog handler instance.

Tekla.Structures.CatalogInternal.ConflictHandler.dotInitializeImportProfilesFromFolder(System.String)
Initializes import of profile items from folder to profile catalog.
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.CatalogInternal.ConflictHandler.dotFinalizeImportProfilesFromFolder
Finalizes import of profile items from folder to profile catalog.
Returns: true if successful.